In [65]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass 

password = getpass.getpass()

connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

········

In [7]:
#1 How many distinct (different) actors' last names are there?

data = pd.read_sql_query('SELECT count(distinct last_name) FROM actor', engine)
data.head()

   count(distinct last_name)
0                        121

In [18]:
#2 Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
data = pd.read_sql_query('''
SELECT *, 
CASE 
WHEN date_format(rental_date,"%%w") in (1,2,3,4,5) then "workday"
WHEN date_format(rental_date,"%%w") in (0,6) then "weekend"
END as col_new
FROM rental
''', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,col_new
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

In [46]:
#3 Get all films with ARMAGEDDON in the title.

data = pd.read_sql_query("""
SELECT film_id, title FROM film
where title like '%%ARMAGEDDON%%';""", engine)
data.head(10)

   film_id                  title
0       39        ARMAGEDDON LOST
1      507    LADYBUGS ARMAGEDDON
2      571       METAL ARMAGEDDON
3      598    MOSQUITO ARMAGEDDON
4      838  STAGECOACH ARMAGEDDON
5      844      STEERS ARMAGEDDON

In [47]:
#4 Get 10 the longest films.

data = pd.read_sql_query("""
SELECT film_id, title, length FROM film
order by length
limit 10;""", engine)
data.head(10)

   film_id                title  length
0      730  RIDGEMONT SUBMARINE      46
1      469            IRON MOON      46
2       15         ALIEN CENTER      46
3      505     LABYRINTH LEAGUE      46
4      504        KWAI HOMEWARD      46
5      247      DOWNHILL ENOUGH      47
6      393       HALLOWEEN NUTS      47
7      398       HANOVER GALAXY      47
8      237      DIVORCE SHINING      47
9      407           HAWK CHILL      47

In [50]:
#5 How many films include Behind the Scenes content?
data = pd.read_sql_query("""
SELECT count(special_features) FROM film
where special_features like '%%Behind the Scenes%%';""", engine)
data.head(10)

   count(special_features)
0                      538

In [53]:
#6 Which kind of movies (rating) have a mean duration of more than two hours?

data = pd.read_sql_query("""
SELECT c.name, avg(f.length) FROM film as f
join film_category as fc
on f.film_id=fc.film_id
join category as c
on fc.category_id = c.category_id
group by c.name;""", engine)
data.head(10)

          name  avg(f.length)
0       Action       111.6094
1    Animation       111.0152
2     Children       109.8000
3     Classics       111.6667
4       Comedy       115.8276
5  Documentary       108.7500
6        Drama       120.8387
7       Family       114.7826
8      Foreign       121.6986
9        Games       127.8361

In [64]:
#7 Rank films by length (filter out the rows that have nulls or 0s in length column). 
#In your output, only select the columns title, length, and the rank.

data = pd.read_sql_query("""
SELECT title, length, rank() over (order by length desc) FROM film 
where (length > 0) or (length is not null);""", engine)
data.head(50)

                     title  length  rank() over (order by length desc)
0            CHICAGO NORTH     185                                   1
1           CONTROL ANTHEM     185                                   1
2           DARN FORRESTER     185                                   1
3              GANGS PRIDE     185                                   1
4                HOME PITY     185                                   1
5            MUSCLE BRIGHT     185                                   1
6             POND SEATTLE     185                                   1
7       SOLDIERS EVOLUTION     185                                   1
8        SWEET BROTHERHOOD     185                                   1
9             WORST BANGER     185                                   1
10       CONSPIRACY SPIRIT     184                                  11
11        CRYSTAL BREAKING     184                                  11
12          KING EVOLUTION     184                                  11
13         MOONWALKER FOOL     184                                  11
14         SMOOCHY CONTROL     184                                  11
15          SONS INTERVIEW     184                                  11
16          SORORITY QUEEN     184                                  11
17          THEORY MERMAID     184                                  11
18           CATCH AMISTAD     183                                  19
19          FRONTIER CABIN     183                                  19
20           SCALAWAG DUCK     183                                  19
21               WIFE TURN     183                                  19
22          YOUNG LANGUAGE     183                                  19
23         BAKED CLEOPATRA     182                                  24
24           MONSOON CAUSE     182                                  24
25           RECORDS ZORRO     182                                  24
26              REDS POCUS     182                                  24
27             SATURN NAME     182                                  24
28          SEARCHERS WAIT     182                                  24
29        ANALYZE HOOSIERS     181                                  30
30        HAUNTING PIANIST     181                                  30
31         HOTEL HAPPINESS     181                                  30
32          INTRIGUE WORST     181                                  30
33           JACKET FRISCO     181                                  30
34          LAWLESS VISION     181                                  30
35           LOVE SUICIDES     181                                  30
36      RUNAWAY TENENBAUMS     181                                  30
37          STAR OPERATION     181                                  30
38             WILD APOLLO     181                                  30
39         ALLEY EVOLUTION     180                                  40
40  CONFIDENTIAL INTERVIEW     180                                  40
41          IMPACT ALADDIN     180                                  40
42             MIXED DOORS     180                                  40
43      MUSSOLINI SPOILERS     180                                  40
44           NASH CHOCOLAT     180                                  40
45          SOMETHING DUCK     180                                  40
46         ANONYMOUS HUMAN     179                                  47
47             BORN SPINAL     179                                  47
48       CASUALTIES ENCINO     179                                  47
49              CAUSE DATE     179                                  47